app/views/dynamic_pages/welcome.html.erb

SELECT "gossips".* FROM "gossips"
SELECT "users".* FROM "users"
---
<ul>
	<%Gossip.all.each do |i|%>
		<%User.all.each do |x|%>
			<a href="gossip/<%=i.id%>"><li><%=x.first_name%>  -  <%=i.title%></li></a>